src/modules/apis/onvif/query/probematches.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:wsdp="http://schemas.xmlsoap.org/ws/2006/02/devprof">
    <soap:Header>
        <wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
        <wsa:MessageID>urn:uuid:__MESSAGE_ID__</wsa:MessageID>
        <wsa:RelatesTo>__RELATES_TO__</wsa:RelatesTo>
        <wsd:AppSequence InstanceId="1742155307" MessageNumber="1"></wsd:AppSequence>
    </soap:Header>
    <soap:Body>
        <wsd:ProbeMatches>
            <wsd:ProbeMatch>
                <wsa:EndpointReference>
                    <wsa:Address>urn:uuid:__ADDRESS__</wsa:Address>
                </wsa:EndpointReference>
                <wsd:Types>wsdp:Device</wsd:Types>
                <wsd:XAddrs>__XADDRS__</wsd:XAddrs>
                <wsd:MetadataVersion>2</wsd:MetadataVersion>
            </wsd:ProbeMatch>
        </wsd:ProbeMatches>
    </soap:Body>
</soap:Envelope>